Description: "Download Installomator.sh"
Identifier: com.github.pro4tlzz.download.installomator
Input: 
  download_url: "https://raw.githubusercontent.com/Installomator/Installomator/main/Installomator.sh"
MinimumVersion: "2.3"
Process: 
  - 
    Arguments: 
      url: "%download_url%"
    Processor: CURLDownloader
