Description: 'This recipe downloads Erase-Install from GitHub, creates a smart group with
  compatible macs & creates a policy'
Identifier: com.github.pro4tlzz.jamf.erase-install
Input:
  CATEGORY: OS
  GROUP_NAME: Monterey Compatible
  GROUP_TEMPLATE: erase-install-SmartGroup.xml
  NAME: Erase-Install
  POLICY_CATEGORY: OS
  POLICY_NAME: Install %NAME%
  POLICY_TEMPLATE: erase-install-policy-template.xml 
  VERSION_CRITERION: Application Version
  SLACK_WEBHOOK: https://hooks.slack.com/services/KEY
MinimumVersion: '2.3'
ParentRecipe: com.github.pro4tlzz.download.erase-install

Process:
- Arguments:
    pkg_category: '%CATEGORY%'
  Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

- Arguments:
    predicate: pkg_uploaded == true
  Processor: StopProcessingIf

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_template: "%GROUP_TEMPLATE%"
    computergroup_name: "%GROUP_NAME%"
    replace_group: "true"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: "%POLICY_TEMPLATE%"
    policy_name: "%POLICY_NAME%"
    replace_policy: "true"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfUploaderSlacker
  Arguments:
    version: "%version%"
    slack_webhook_url: "%SLACK_WEBHOOK%"
    PKG_CATEGORY: '%CATEGORY%'
    jamfpackageuploader_summary_result: 'true'
    jamfpolicyuploader_summary_result: 'true'
