<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>CHECKIN</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other/>
        <frequency>Ongoing</frequency>
        <retry_event>none</retry_event>
        <retry_attempts>-1</retry_attempts>
        <notify_on_each_failed_retry>false</notify_on_each_failed_retry>
        <location_user_only>false</location_user_only>
        <target_drive>/</target_drive>
        <offline>false</offline>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <site>
            <name>None</name>
        </site>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computers/>
        <computer_groups>
            <computer_group>
                <name>%GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <buildings/>
        <departments/>
        <limit_to_users>
            <user_groups/>
        </limit_to_users>
        <limitations>
            <users/>
            <user_groups/>
            <network_segments/>
            <ibeacons/>
        </limitations>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <id>007</id>
                    <name>ANY GROUP TO EXCLUDE</name>
                </computer_group>
            </computer_groups>
            <buildings/>
            <departments/>
            <users/>
            <user_groups/>
            <network_segments/>
            <ibeacons/>
        </exclusions>
    </scope>
      <self_service>
        <use_for_self_service>true</use_for_self_service>
        <self_service_display_name>MacOS Monterey Upgrade</self_service_display_name>
        <install_button_text>Upgrade to Monterey</install_button_text>
        <reinstall_button_text>Upgrade to Monterey</reinstall_button_text>
        <self_service_description>This will upgrade your Operating System to the most recent available. This process will take some time to complete and you will not be able to use your machine at this time. &#13;
&#13;
PLEASE NOTE: PLEASE ENSURE ANY UNSAVED WORK IS SAVED BEFORE PROCEEDING.&#13;
PLEASE BACKUP ALL YOUR IMPORTANT FILES BEFORE PROCEEDING&#13;
&#13;
macOS Monterey delivers groundbreaking new features that help users connect in new ways, accomplish more, and work seamlessly across their Apple devices. FaceTime includes new audio and video features that make calls feel more natural and lifelike, and new Continuity tools like AirPlay to Mac enable Apple devices to work even better together. Live Text and Visual Lookup bring new intelligence features to surface useful information, Safari includes powerful tab organization with Tab Groups, and the ease of automation comes to the Mac with Shortcuts.</self_service_description>
        <force_users_to_view_description>true</force_users_to_view_description>
        <self_service_icon>
            <id>20838</id>
            <filename>del3rk1-177dea3e-01d6-4c32-bcfd-8927b7bc8364.png</filename>
            <uri>https://madecom.jamfcloud.com//iconservlet/?id=20838</uri>
        </self_service_icon>
        <feature_on_main_page>false</feature_on_main_page>
        <self_service_categories>
            <category>
                <id>14</id>
                <name>OS</name>
                <display_in>true</display_in>
                <feature_in>false</feature_in>
            </category>
        </self_service_categories>
    </self_service>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
                <fut>false</fut>
                <feu>false</feu>
            </package>
        </packages>
    </package_configuration>
    <maintenance>
        <recon>true</recon>
        <reset_name>false</reset_name>
        <install_all_cached_packages>false</install_all_cached_packages>
        <heal>false</heal>
        <prebindings>false</prebindings>
        <permissions>false</permissions>
        <byhost>false</byhost>
        <system_cache>false</system_cache>
        <user_cache>false</user_cache>
        <verify>false</verify>
    </maintenance>
    <files_processes>
        <search_by_path/>
        <delete_file>false</delete_file>
        <locate_file/>
        <update_locate_database>false</update_locate_database>
        <spotlight_search/>
        <search_for_process/>
        <kill_process>false</kill_process>
        <run_command>/usr/local/bin/jamf policy -id Kickoff a policy to actually run erase-install</run_command>
    </files_processes>
</policy>