Description: | 
   NOTE This recipe doesn't work as the download processor seems to fail with this policy ID

Identifier: com.github.pro4tlzz.jamf.CrowdstrikeFalcon-MojavePinned
ParentRecipe: com.github.mlbz521.download.CrowdStrikeFalcon
MinimumVersion: '2.3'

Input:
  NAME: Crowdstrike Falcon Mac Sensor Mojave Pinned
  CATEGORY: Security
  POLICY_CATEGORY: Security
  POLICY_NAME: "Install %NAME%"
  POLICY_TEMPLATE: FalconPolicyTemplate.xml
  CLIENT_ID: 123
  CLIENT_SECRET: 123
  POLICY_ID: 123
  API_REGION_URL: https://api.crowdstrike.com
  PARAMETER5_VALUE: 123-E1
  PARAMETER4_VALUE: 123
  SCRIPT_FILENAME: FalconScript.sh
  SCRIPT_PARAMETER4: token
  SCRIPT_PARAMETER5: license
  SCRIPT_NAME: FalconScript.sh
  SCRIPT_PRIORITY: After
  GROUP_TEMPLATE: AltGroup-MojavePinned.xml
  GROUP_NAME: Falcon Profile Installed, Falcon Agent not installed - Mojave Pinned
  PROFILE_UUID1: 123
  PROFILE_UUID2: 123
  
Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: "%CATEGORY%"

- Processor: StopProcessingIf
  Arguments:
    predicate: "pkg_uploaded == True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
  Arguments:  
    script_path: "%SCRIPT_FILENAME%"
    script_parameter4: "%SCRIPT_PARAMETER4%"
    script_parameter5: "%SCRIPT_PARAMETER5%"
    script_category: "%POLICY_CATEGORY%"
    replace_script: "false"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_template: "%GROUP_TEMPLATE%"
    computergroup_name: "%GROUP_NAME%"
    replace_group: "false"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: "%POLICY_NAME%"
    policy_template: "%POLICY_TEMPLATE%"
    replace_policy: "false"