<?xml version="1.0" encoding="utf-8"?>
<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_other>--installfalcon</trigger_other>
         <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
      <site>
        <name>None</name>
      </site>
    </general>
	<scope>
		<computer_groups>
			<computer_group>
				<name>%GROUP_NAME%</name>
			</computer_group>
		</computer_groups>
	</scope>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <scripts>
        <script>
            <name>%SCRIPT_NAME%</name>
            <priority>%SCRIPT_PRIORITY%</priority>
            <parameter4>%PARAMETER4_VALUE%</parameter4>
            <parameter5>%PARAMETER5_VALUE%</parameter5>
            <parameter6></parameter6>
            <parameter7></parameter7>
            <parameter8></parameter8>
            <parameter9></parameter9>
            <parameter10></parameter10>
            <parameter11></parameter11>
        </script>
    </scripts>
    <maintenance>
        <recon>true</recon>
        <reset_name>false</reset_name>
        <install_all_cached_packages>false</install_all_cached_packages>
        <heal>false</heal>
        <prebindings>false</prebindings>
        <permissions>false</permissions>
        <byhost>false</byhost>
        <system_cache>false</system_cache>
        <user_cache>false</user_cache>
        <verify>false</verify>
    </maintenance>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
</policy>