<policy>
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger>CHECKIN</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other/>
        <frequency>Ongoing</frequency>
        <retry_event>none</retry_event>
        <retry_attempts>-1</retry_attempts>
        <notify_on_each_failed_retry>false</notify_on_each_failed_retry>
        <location_user_only>false</location_user_only>
        <target_drive>/</target_drive>
        <offline>false</offline>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <site>
            <name>None</name>
        </site>
    </general>
    <scope>
        <all_computers>false</all_computers>
        <computers/>
        <computer_groups>
            <computer_group>
                <name>%GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <buildings/>
        <departments/>
        <limit_to_users>
            <user_groups/>
        </limit_to_users>
        <limitations>
            <users/>
            <user_groups/>
            <network_segments/>
            <ibeacons/>
        </limitations>
        <exclusions>
            <computers/>
            <computer_groups>
                <computer_group>
                    <name>$AN EXISTING GROUP</name>
                </computer_group>
            </computer_groups>
            <buildings/>
            <departments/>
            <users/>
            <user_groups/>
            <network_segments/>
            <ibeacons/>
        </exclusions>
    </scope>
    <self_service>
        <use_for_self_service>false</use_for_self_service>
    </self_service>
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
                <fut>false</fut>
                <feu>false</feu>
            </package>
        </packages>
    </package_configuration>
    <maintenance>
        <recon>true</recon>
        <reset_name>false</reset_name>
        <install_all_cached_packages>false</install_all_cached_packages>
        <heal>false</heal>
        <prebindings>false</prebindings>
        <permissions>false</permissions>
        <byhost>false</byhost>
        <system_cache>false</system_cache>
        <user_cache>false</user_cache>
        <verify>false</verify>
    </maintenance>
    <files_processes>
        <search_by_path/>
        <delete_file>false</delete_file>
        <locate_file/>
        <update_locate_database>false</update_locate_database>
        <spotlight_search/>
        <search_for_process/>
        <kill_process>false</kill_process>
        <run_command>/usr/local/bin/jamf policy -id A Policy With branding, LaunchAgent & Logging</run_command>
    </files_processes>
</policy>